Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: A lot of work has been done to make the Swagger/GraphQL/Health/OpenAPI UIs consistent and Quarkus-themed.
ja_jp: Swagger/GraphQL/Health/OpenAPI UI を一貫して Quarkus をテーマにしたものにするために、多くの作業が行われました。

source: A major issue in processing or an inability to complete a request.
ja_jp: 処理中の重大な問題またはリクエストを完了できない状態。

source: A map value can be also accessed directly: `{map.myKey}`. Use the bracket notation for keys that are not legal identifiers: `{map['my key']}`.
ja_jp: マップ値は、直接アクセスすることもできます (`{map.myKey}`)。正規の識別子ではないキーにはブラケット表記を使用します (`{map['my key']}`)。

source: A mapping configurer (`HibernateOrmSearchMappingConfigurer`) allows much more than just programmatic mapping capabilities. It also allows link:{hibernate-search-docs-url}#mapper-orm-mapping-configurer[configuring annotation mapping, bridges, and more].
ja_jp: マッピング Configurer (`HibernateOrmSearchMappingConfigurer`) を使用すると、単なるプログラムによるマッピング機能以上のものを実現できます。 link:{hibernate-search-docs-url}#mapper-orm-mapping-configurer[アノテーションマッピング、ブリッジなどの設定] も実現されます。

source: A mapping configurer (`StandalonePojoMappingConfigurer`) allows much more than just programmatic mapping capabilities. It also allows link:{hibernate-search-docs-url}#mapper-pojo-standalone-mapping-configurer[configuring annotation mapping, bridges, and more].
ja_jp: マッピング Configurer (`StandalonePojoMappingConfigurer`) を使用すると、単なるプログラムによるマッピング機能以上のものを実現できます。 link:{hibernate-search-docs-url}#mapper-pojo-standalone-mapping-configurer[アノテーションマッピング、ブリッジなどの設定] も実現されます。

source: A mapping interface implementation is not a proxy, so it cannot be mocked directly with `@InjectMock` like other CDI beans. One trick is to make it proxyable with a producer method:
ja_jp: マッピングインターフェースの実装はプロキシではありませんので、他のCDI Beanのように `@InjectMock` で直接モックすることはできません。一つの方法として、プロデューサ・メソッドでプロキシ可能にすることがあります。

source: A maturity matrix for Quarkus extensions
ja_jp: Quarkus エクステンションの成熟度マトリックス

source: A merge of the `shared-data` from the all the codestarts used to generate the project
ja_jp: プロジェクトの生成に使用されたすべてのCodestartから `shared-data` をマージしたもの

source: A message is acknowledged back to the broker when its processing or reception has been successful. Acknowledgements between messages are chained, meaning that when processing a message, the acknowledgement of an outgoing message triggers the acknowledgement of incoming message(s). In most cases, acks and nacks are managed for you and connectors allow you to configure different strategies per channel. So, you usually don't need to interact with the `Message` interface directly. Only advanced use cases require dealing with the Message directly.
ja_jp: メッセージの処理または受信が成功すると、ブローカーに確認応答が返されます。 メッセージ間の確認応答は連鎖しており、メッセージを処理する際には、 発信メッセージの確認は、着信メッセージの確認をトリガーします。 ほとんどの場合、確認応答と否定応答は自動的に管理され、コネクターを使用するとチャネルごとに異なるストラテジーを設定できます。 したがって、通常は `Message` インターフェイスと直接やり取りする必要はありません。 高度なユースケースでのみ、Message と直接処理する必要があります。

source: A method annotated with `@io.quarkus.scheduler.Scheduled` is automatically scheduled for invocation. A scheduled method must not be abstract or private. It may be either static or non-static. A scheduled method can be annotated with interceptor bindings, such as `@jakarta.transaction.Transactional` and `@org.eclipse.microprofile.metrics.annotation.Counted`.
ja_jp: `@io.quarkus.scheduler.Scheduled` でアノテーションされたメソッドは、自動的に呼び出しがスケジュールされます。スケジュールされたメソッドは、abstractやprivateであってはなりません。静的または非静的であっても大丈夫です。スケジュールされたメソッドには、 `@jakarta.transaction.Transactional` や `@org.eclipse.microprofile.metrics.annotation.Counted` のようなインターセプターバインディングをアノテーションすることができます。

source: A method annotated with `@io.quarkus.scheduler.Scheduled` is automatically scheduled for invocation. A scheduled method must not be abstract or private. It may be either static or non-static. A scheduled method can be annotated with interceptor bindings, such as `@jakarta.transaction.Transactional`.
ja_jp: `@io.quarkus.scheduler.Scheduled` でアノテーションされたメソッドは、自動的に呼び出しがスケジュールされます。スケジュールされたメソッドは、abstract または private であってはなりません。静的または非静的のいずれでもかまいません。スケジュールされたメソッドには、`@jakarta.transaction.Transactional` のようなインターセプターバインディングをアノテーションできます。

source: A method annotated with `@io.quarkus.scheduler.Scheduled` is automatically scheduled for invocation. A scheduled method must not be abstract or private. It may be either static or non-static. A scheduled method can be annotated with interceptor bindings, such as `@javax.transaction.Transactional` and `@org.eclipse.microprofile.metrics.annotation.Counted`.
ja_jp: メソッドに `@io.quarkus.scheduler.Scheduled` をアノテーションすると、自動的に呼び出されるようにスケジュールされます。実際には、そのようなメソッドはCDI Beanの非プライベート非静的メソッドでなければなりません。CDI Beanのメソッドであることの結果として、スケジュールされたメソッドは、 `@javax.transaction.Transactional` や `@org.eclipse.microprofile.metrics.annotation.Counted` のようなインターセプターバインディングでアノテーションすることができます。

source: A method annotated with `CacheResult` is protected by a lock on cache miss mechanism. If several concurrent invocations try to retrieve a cache value from the same missing key, the method will only be invoked once. The first concurrent invocation will trigger the method invocation while the subsequent concurrent invocations will wait for the end of the method invocation to get the cached result. The `lockTimeout` parameter can be used to interrupt the lock after a given delay. The lock timeout is disabled by default, meaning the lock is never interrupted. See the parameter Javadoc for more details.
ja_jp: `CacheResult` でアノテーションされたメソッドは、キャッシュミスのロックメカニズムによって保護されています。複数の同時呼び出しが同じ欠落キーからキャッシュ値を取得しようとした場合、メソッドは一度だけ呼び出されます。最初の同時呼び出しはメソッドの呼び出しをトリガし、その後の同時呼び出しはキャッシュされた結果を取得するためにメソッドの呼び出しの終了を待ちます。 `lockTimeout` パラメーターを使用すると、所定の遅延後にロックを中断することができます。ロックのタイムアウトは既定では無効になっており、ロックが中断されることはありません。詳細は、パラメーター Javadoc を参照してください。

source: A method annotated with `CacheResult` is protected by a lock on cache miss mechanism. If several concurrent invocations try to retrieve a cache value from the same missing key, the method will only be invoked once. The first concurrent invocation will trigger the method invocation, while the subsequent concurrent invocations will wait for the end of the method invocation to get the cached result. The `lockTimeout` parameter can be used to interrupt the lock after a given delay. The lock timeout is disabled by default, meaning the lock is never interrupted. See the parameter Javadoc for more details.
ja_jp: `CacheResult` でアノテーションされたメソッドは、キャッシュミス時のロックメカニズムによって保護されます。複数の同時呼び出しが同じ見つからないキーからキャッシュ値を取得しようとした場合、メソッドは一度だけ呼び出されます。最初の同時呼び出しがメソッド呼び出しをトリガーし、その後の同時呼び出しはメソッド呼び出しの終了を待ってキャッシュされた結果を取得します。 `lockTimeout` パラメーターは、指定された遅延後にロックを中断するために使用できます。ロックタイムアウトはデフォルトで無効になっており、ロックが中断されることはありません。詳細については、パラメーターの Javadoc を参照してください。

source: A microservice which the front-end Quarkus application will access by propagating authorization code flow access tokens to it is represented in the Auth0 dashboard as an `API`. Let's add it in the `Applications/APIs`:
ja_jp: フロントエンドの Quarkus アプリケーションが認可コードフローのアクセストークンを伝播してアクセスするマイクロサービスは、Auth0 ダッシュボードでは `API` として表されます。これを `Applications/APIs` に追加してみましょう。

source: A minimal REST application created with quarkus create app sees startup drop from **370 ms** to **80 ms**.
ja_jp: quarkus create app で作成された最小限の REST アプリケーションは、起動時間が**370 ミリ秒**から**80 ミリ秒**に短縮されました。

source: A minimal configuration for the Kafka connector with an incoming channel looks like the following:
ja_jp: 着信チャンネルを持つ Kafka コネクターの最小設定は次のようになります。

source: A minimal configuration for the Pulsar connector with an incoming channel looks like the following:
ja_jp: 着信チャネルを持つ Pulsar コネクターの最小設定は次のようになります。

source: A modular codebase is the best way to avoid these kind of issues. Taking the JAXB/AWT problem above, if the JAXB code that dealt with images was in a separate module or jar (e.g. `jaxb-images`), then Quarkus could choose not to include that module unless the user specifically requested the need to serialize/deserialize XML files containing images at build time.
ja_jp: モジュール式のコードベースは、この種の問題を回避するための最良の方法です。上記の JAXB/AWT の問題を考えると、イメージを扱う JAXB コードが別のモジュールまたは jar (例: `jaxb-images`) にあった場合、Quarkus は、構築時に画像を含むXMLファイルをシリアライズ/デシリアライズする必要があるとユーザーが特に要求しない限り、そのモジュールを含めないように選択することができます。

source: A more advanced option would be to directly provide a bean of `jakarta.json.bind.JsonbConfig` (with a `Dependent` scope) or in the extreme case to provide a bean of type `jakarta.json.bind.Jsonb` (with a `Singleton` scope). If the latter approach is leveraged it is very important to manually inject and apply all `io.quarkus.jsonb.JsonbConfigCustomizer` beans in the CDI producer that produces `jakarta.json.bind.Jsonb`. Failure to do so will prevent JSON-B specific customizations provided by various extensions from being applied.
ja_jp: より高度なオプションは， `jakarta.json.bind.JsonbConfig` の Bean を( `Dependent` スコープで)直接提供するか，極端な場合， `jakarta.json.bind.Jsonb` タイプの Bean を( `Singleton` スコープで)提供することでしょう。後者の方法を利用する場合、 `jakarta.json.bind.Jsonb` を生成するCDIプロデューサーにおいて、すべての `io.quarkus.jsonb.JsonbConfigCustomizer` Beanを手動で注入し適用することが非常に重要です。これを怠ると、さまざまなエクステンションが提供するJSON-B固有のカスタマイズが適用されなくなります。

source: A more advanced option would be to directly provide a bean of `jakarta.json.bind.JsonbConfig` (with a `Dependent` scope) or, in the extreme case, to provide a bean of type `jakarta.json.bind.Jsonb` (with a `Singleton` scope). If the latter approach is leveraged it is very important to manually inject and apply all `io.quarkus.jsonb.JsonbConfigCustomizer` beans in the CDI producer that produces `jakarta.json.bind.Jsonb`. Failure to do so will prevent JSON-B specific customizations provided by various extensions from being applied.
ja_jp: より高度なオプションは、`jakarta.json.bind.JsonbConfig` の Bean を (`Dependent` スコープで) 直接提供するか、極端な場合、`jakarta.json.bind.Jsonb` タイプの Bean を (`Singleton` スコープで) 提供することでしょう。 後者の方法を利用する場合、`jakarta.json.bind.Jsonb` を生成する CDI プロデューサーにおいて、すべての `io.quarkus.jsonb.JsonbConfigCustomizer` Bean を手動で注入し適用することが非常に重要です。 これを怠ると、さまざまなエクステンションが提供する JSON-B 固有のカスタマイズが適用されなくなります。

source: A more advanced option would be to directly provide a bean of `javax.json.bind.JsonbConfig` (with a `Dependent` scope) or in the extreme case to provide a bean of type `javax.json.bind.Jsonb` (with a `Singleton` scope). If the latter approach is leveraged it is very important to manually inject and apply all `io.quarkus.jsonb.JsonbConfigCustomizer` beans in the CDI producer that produces `javax.json.bind.Jsonb`. Failure to do so will prevent JSON-B specific customizations provided by various extensions from being applied.
ja_jp: より高度なオプションとしては、 `javax.json.bind.JsonbConfig` ( `Dependent` スコープ付き)の Bean を直接提供するか、極端な場合には `javax.json.bind.Jsonb` ( `Singleton` スコープ付き)のタイプの Bean を提供することが考えられます。後者のアプローチを利用する場合は、 `javax.json.bind.Jsonb` を生成する CDI プロデューサに `io.quarkus.jsonb.JsonbConfigCustomizer` Bean をすべて手動で注入して適用することが非常に重要です。これを怠ると、様々なエクステンションによって提供される JSON-B 固有のカスタマイズが適用されなくなります。

source: A more compact way to configure the token endpoint URL without the discovery is to set `quarkus.oidc-client.token-path` to an absolute URL:
ja_jp: ディスカバリーなしでトークンエンドポイント URL を設定する、よりコンパクトな方法は、 `quarkus.oidc-client.token-path` を絶対 URL に設定することです。

source: A more comprehensive example
ja_jp: より包括的な例

source: A more detailed example:
ja_jp: より詳細な例:

source: A name or value property of this consumer. `properties` is application defined metadata attached to a consumer. When getting a topic stats, associate this metadata with the consumer stats for easier identification.
ja_jp: このコンシューマの名前または値のプロパティ。

source: A name resolver with the namespace `Status` is generated automatically.
ja_jp: 名前空間 `Status` を持つネームリゾルバーが自動的に生成される。

source: A name resolver with the namespace `model_Status` is generated automatically.
ja_jp: 名前空間 `model_Status` を持つネームリゾルバーが自動的に生成されます。

source: A name resolver with the namespace `model_Statuses` is generated automatically.
ja_jp: 名前空間が `model_Statuses` のネームリゾルバーが自動的に生成されます。

source: A name supplied to the connector will override any statically configured name. This can be useful for establishing a default configuration which can be overridden at runtime as necessary.
ja_jp: コネクターに指定された名前は、静的に設定された名前をすべて上書きします。これは、実行時に必要に応じて上書きできるデフォルト設定を確立するのに役立ちます。

source: A named `users` persistence unit which will contain all the model classes under the `org.acme.model.user` package, subpackages included.
ja_jp: `users` という名前の永続化ユニットで、 `org.acme.model.user` パッケージのすべてのモデルクラスを含み、サブパッケージも含まれています。

source: A named datasource called `additional1` - using PostgreSQL.
ja_jp: `additional1` と呼ばれる名前付きデータソース - PostgreSQL を使用。

source: A named datasource called `additional2` - using MySQL.
ja_jp: `additional2` と呼ばれる名前付きデータソース - MySQL を使用。

source: A namespace can only consist of alphanumeric characters and underscores.
ja_jp: 名前空間は、英数字とアンダースコアだけで構成されます。

source: A namespace resolver can be used to access a hidden fragment too. `capture:` can be replaced with `cap:`.
ja_jp: 名前空間リゾルバを使用して、非表示のフラグメントにアクセスすることもできます。 `capture:` は、 `cap:` に置き換えることができます。

source: A native executable will be present in `build/`.
ja_jp: ネイティブ実行可能ファイルは、 `build/` に存在します。

source: A native executable will be present in `target/`.
ja_jp: ネイティブ実行可能ファイルが `target/` に存在します。

source: A native image bundle containing everything required to build a native image can be generated. This is useful to inspect the build inputs and configuration.
ja_jp: ネイティブイメージのビルドに必要なすべてを含むネイティブイメージバンドルを生成できます。これは、ビルドの入力内容や設定を検査するのに役立ちます。

source: A nested configuration group may be wrapped with an `Optional` type. In this case, the group is not populated unless one or more properties within that group are specified in the configuration. If the group is populated, then any required properties in the group must also be specified otherwise a configuration error will be reported and the application will not start.
ja_jp: ネストされた設定グループは、 `Optional` タイプでラップできます。この場合、そのグループ内の 1 つ以上のプロパティーが設定で指定されていない限り、グループは設定されません。グループが入力されている場合は、グループ内の必要なプロパティーも指定する必要があります。指定しないと、設定エラーが報告され、アプリケーションが起動しません。

source: A nested mapping provides a way to subgroup other config properties:
ja_jp: ネストされたマッピングは、他の設定プロパティをサブグループ化する方法を提供します。

source: A new Dev Services API in Quarkus 3.25 fixes port conflicts and excessive resource usage in test suites, while providing a simpler programming model for extension authors.
ja_jp: Quarkus 3.25 における新しい Dev Services API は、エクステンション開発者によりシンプルなプログラミングモデルを提供しつつ、テストスイートにおけるポートの競合や過剰なリソース消費を修正します。

source: A new Dev UI has been implemented in Quarkus 3.x. Not all the features are available yet. You can still access the previous version of the Dev UI using: http://localhost:8080/q/dev-ui/.
ja_jp: Quarkus 3.xでは、新しいDev UIが実装されました。 全ての機能が利用できる訳ではありません。 以前のバージョンのDev UIには、 http://localhost:8080/q/dev-ui/ で引き続きアクセスすることが可能です。

source: A new Dev UI has been implemented in Quarkus 3.x. Not all the features are available yet. You can still access the previous version of the Dev UI using: http://localhost:8080/q/dev-v1/.
ja_jp: Quarkus 3.xでは、新しいDev UIが実装されましたが、まだすべての機能が利用可能ではありません。以前のバージョンのDev UIには、 http://localhost:8080/q/dev-v1/ を使ってアクセスできます。

source: A new Micrometer extension
ja_jp: 新しいMicrometerエクステンション

source: A new Redis backend for the Cache extension
ja_jp: Cacheエクステンションのための新しいRedisバックエンド

source: A new `io.quarkus:quarkus-awt` extension for AWT and Java2D usage was added to enable various AWT use-cases, such as image resizing.
ja_jp: AWTとJava2Dを使用するための新しい `io.quarkus:quarkus-awt` エクステンションが追加され、画像のリサイズなど様々なAWTのユースケースが可能になりました。

source: A new contract `CacheKeyGenerator` was introduced in 2.10 to allow for this customization.
ja_jp: このカスタマイズを可能にするために、2.10で新しいコントラクト `CacheKeyGenerator` が導入されました。

source: A non-anonymous caller name: `jdoe@quarkus.io`
ja_jp: 匿名でない発信者名: `jdoe@quarkus.io`

source: A non-critical service error or problem that may not require immediate correction.
ja_jp: 重要ではないサービスのエラーや問題で、すぐに修正する必要がない場合があります

source: A non-critical service error or problem that might not require immediate correction.
ja_jp: 重大ではないサービスエラーまたは即時の修正を必要としない可能性がある問題。

source: A non-null `JsonWebToken`
ja_jp: null 以外の `JsonWebToken`

source: A note about multi-user and thread safety
ja_jp: マルチユーザーとスレッドセーフに関する注意

source: A note about usernames and credential IDs
ja_jp: ユーザー名と認証情報 ID に関する注意点

source: A number of OIDC property combinations required to address various OIDC and OAuth2 requirements can be very large.
ja_jp: さまざまな OIDC および OAuth2 の要件に対処するために必要な OIDC プロパティーの組み合わせの数は、非常に膨大になる可能性があります。

source: A package-private constructor injection. `@Inject` is optional in this particular case.
ja_jp: パッケージプライベートコンストラクター注入。この特定の場合、 `@Inject` は任意です。

source: A package-private injection field.
ja_jp: package-private injection フィールド。

source: A package-private observer method.
ja_jp: package-private observer メソッド。

source: A pair of Dockerfiles for native and JVM modes are also generated in `src/main/docker`. Instructions to build the image and run the container are written in those Dockerfiles.
ja_jp: ネイティブモードとJVMモード用の一対のDockerfilesも `src/main/docker` で生成されます。これらのDockerfileには、イメージをビルドしてコンテナを実行する手順が書かれています。

source: A pair of Dockerfiles for native and jvm mode are also generated in `src/main/docker`. Instructions to build the image and run the container are written in those Dockerfiles.
ja_jp: ネイティブモードと jvm モード用の Dockerfile も `src/main/docker` に生成されています。イメージのビルドとコンテナーの実行の指示は、これらの Dockerfile に書かれています。

source: A parameter declaration may specify the _default value_ after the key. The key and the default value are separated by an equals sign: `{@int age=10}`. The default value is used in the template if the parameter key resolves to `null` or is not found.
ja_jp: パラメーター宣言では、キーの後に _default value_ を指定することができます。 キーとデフォルト値は等号で区切られます (`{@int age=10}`)。 デフォルト値は、パラメーターのキーが `null` に解決されるか、見つからない場合に、テンプレート内で使用されます。

source: A part of an expression can be a _virtual method_ in which case the name can be followed by a list of comma-separated parameters in parentheses. A parameter of a virtual method can be either a nested expression or a <<literals, literal>> value. We call these method _"virtual"_ because they does not have to be backed by a real Java method. You can learn more about virtual methods in the <<virtual_methods,following section>>.
ja_jp: 式の一部を _仮想メソッド_ に することもでき、その場合は名前の後に、カンマで区切られたパラメータのリストを括弧で囲むことができます。 仮想メソッドのパラメータは、ネストされた式か xref:literals[リテラル] 値です。 これらのメソッドを _"仮想" と_ 呼ぶのは、実際の Java メソッドによってバックされる必要がないからです。 仮想メソッドについては、 xref:virtual_methods[次のセクション] で詳しく説明します。

source: A part of an expression can be a _virtual method_ in which case the name can be followed by a list of comma-separated parameters in parentheses. A parameter of a virtual method can be either a nested expression or a <<literals, literal>> value. We call these methods _"virtual"_ because they do not have to be backed by a real Java method. You can learn more about virtual methods in the <<virtual_methods,following section>>.
ja_jp: 式の一部を _仮想メソッド_ とすることができ、その場合、名前の後にコンマで区切られたパラメーターのリストを括弧で囲むことができます。仮想メソッドのパラメーターは、ネストされた式か、<<literals, リテラル>> 値のどちらかにすることができます。これらのメソッドを _"仮想"_ と呼ぶのは、実際の Java メソッドによってバックアップされる必要がないためです。仮想メソッドの詳細については、<<virtual_methods,次のセクション>> の仮想メソッドを参照してください。

source: A part of an expression can be a _virtual method_ in which case the name can be followed by a list of comma-separated parameters in parentheses. A parameter of a virtual method can be either a nested expression or a <<literals,literal>> value. We call these methods _"virtual"_ because they do not have to be backed by a real Java method. You can learn more about virtual methods in the <<virtual_methods,following section>>.
ja_jp: 式の一部を _仮想メソッド_ とすることができ、その場合、名前の後にコンマで区切られたパラメーターのリストを括弧で囲みます。 仮想メソッドのパラメーターは、ネストされた式か、<<literals,literal>> 値のどちらかにすることができます。 これらのメソッドを _"仮想"_ と呼ぶのは、実際の Java メソッドによってバックアップされる必要がないためです。 仮想メソッドの詳細については、<<virtual_methods,following section>> を参照してください。

source: A part of an expression can be a _virtual method_ in which case the name can be followed by a list of comma-separated parameters in parentheses. A parameter of a virtual method can be either a nested expression or a xref:literals[literal] value. We call these methods _"virtual"_ because they do not have to be backed by a real Java method. You can learn more about virtual methods in the xref:virtual_methods[following section].
ja_jp: 式の一部を _仮想メソッド_ にすることもでき、その場合は名前の後にカンマで区切られたパラメータのリストを括弧で囲むことができます。仮想メソッドのパラメータは、ネストした式か xref:literals[リテラル] 値のどちらかです。このようなメソッドを _"仮想"_ と呼ぶのは、実際のJavaメソッドに裏打ちされる必要がないためです。仮想メソッドについては、 xref:virtual_methods[次のセクション] で詳しく説明します。

source: A path to the Maven user settings file may need to be passed to test processes, for example, in case the Maven build process was not launched using the default `mvn` scripts included in the Maven distribution. It could be done in the following way:
ja_jp: Maven ビルドプロセスが Maven ディストリビューションに含まれるデフォルトの `mvn` スクリプトを使用して起動されなかった場合など、Maven ユーザー設定ファイルへのパスをテストプロセスに渡す必要があります。 それは次の方法で行うことができます：

source: A per-category configuration example:
ja_jp: カテゴリーごとの設定の例：

source: A periodical video podcast hosted by Quarkus Developers about things moving in and around Quarkus ecosystem. View the <a href="{{site.baseurl}}/insights">live podcasts</a> and check out older episodes on the Podcasts.
ja_jp: Quarkusエコシステム内および周辺に関する、Quarkus開発者によってホストされる定期的なビデオポッドキャストです。 <a href="{{site.baseurl}}/insights">ライブポッドキャスト</a> を視聴し、過去のエピソードをチェックしてみて下さい。

source: A permission checker authorizing an HTTP upgrade must declare exactly one method parameter, the `SecurityIdentity`.
ja_jp: HTTP アップグレードを承認する権限チェッカーは、メソッドパラメーター `SecurityIdentity` を 1 つだけ宣言する必要があります。

source: A platform stream operates against a remote registry. Each registry defines one or more platform streams, and each stream defines one or more platform release BOM files that define how projects using that stream should be configured.
ja_jp: プラットフォーム・ストリームは、リモート・レジストリに対して動作します。各レジストリは1つ以上のプラットフォーム・ストリームを定義し、各ストリームは、そのストリームを使用するプロジェクトの設定方法を定義する1つ以上のプラットフォーム・リリースBOMファイルを定義します。

source: A platform thread used to execute a virtual thread is called a **carrier** thread. It isn't a class distinct from link:{Thread}[Thread] or `VirtualThread` but rather a functional denomination.
ja_jp: 仮想スレッドを実行するために使用されるプラットフォームスレッドは、**キャリアースレッド** と呼ばれます。 これは link:{Thread}[スレッド] または `VirtualThread` とは異なるクラスではなく、機能的な呼称です。

source: A platform thread used to execute a virtual thread is called a carrier. This isn't a class distinct from link:{Thread}[Thread] or VirtualThread but rather a functional denomination.
ja_jp: 仮想スレッドを実行するために使用されるプラットフォームスレッドをキャリアと呼びます。これは link:{Thread}[Thread] や VirtualThreadとは別のクラスではなく、機能的な呼称です。

source: A point about performance
ja_jp: 性能に関するポイント

source: A port value of zero will result in a randomly assigned port.
ja_jp: ポート値がゼロの場合、ポートはランダムに割り当てられます。

source: A possibly unusable OpenAPI document, as the documentation grows in size with each added resource method
ja_jp: リソースメソッドが追加されるたびにドキュメントのサイズが大きくなり、OpenAPI ドキュメントが使い物にならなくなる可能性がある

source: A potential workaround is to register the other extension programmatically as an instance field via `@RegisterExtension`. This alone is enough to delay its instantiation and prevent the issue from occurring. Here is an example:
ja_jp: 潜在的な回避策として、`@RegisterExtension` を介して他のエクステンションをインスタンスフィールドとしてプログラムで登録することが挙げられます。これだけで、そのインスタンス化を遅らせ、問題の発生を防ぐのに十分です。以下に例を示します。

source: A primitive type.
ja_jp: Java プリミティブタイプ。

source: A project based on {project-name} version 2.13 or later.
ja_jp: {project-name} バージョン2.13以降に基づくプロジェクト。

source: A project developed with high velocity
ja_jp: ハイスピードで開発されたプロジェクト

source: A project file browser. Files can be opened and edited inline. Extensions may add workspace actions.
ja_jp: プロジェクトファイルブラウザー。ファイルはインラインで開いたり編集したりできます。エクステンションはワークスペースアクションを追加できます。

source: A property can also be a `java.util.Map`. The key of the map can be any primitive type and `String`. For example:
ja_jp: プロパティーは `java.util.Map` でもよいです。 マップのキーは、任意のプリミティブ型と `String` が利用できます。例えば、以下のようになります。
